; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-6)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	)
(:init
	(at plane1 city3)
	(= (capacity plane1) 13343)
	(= (fuel plane1) 2119)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 19)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 7)
	(at plane2 city1)
	(= (capacity plane2) 5312)
	(= (fuel plane2) 925)
	(= (slow-burn plane2) 2)
	(= (fast-burn plane2) 6)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 9)
	(at plane3 city5)
	(= (capacity plane3) 10655)
	(= (fuel plane3) 32)
	(= (slow-burn plane3) 5)
	(= (fast-burn plane3) 10)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 6)
	(at person1 city7)
	(at person2 city3)
	(at person3 city7)
	(at person4 city8)
	(at person5 city0)
	(at person6 city3)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 639)
	(= (distance city0 city2) 666)
	(= (distance city0 city3) 826)
	(= (distance city0 city4) 893)
	(= (distance city0 city5) 845)
	(= (distance city0 city6) 665)
	(= (distance city0 city7) 721)
	(= (distance city0 city8) 575)
	(= (distance city1 city0) 639)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 914)
	(= (distance city1 city3) 988)
	(= (distance city1 city4) 792)
	(= (distance city1 city5) 995)
	(= (distance city1 city6) 776)
	(= (distance city1 city7) 915)
	(= (distance city1 city8) 708)
	(= (distance city2 city0) 666)
	(= (distance city2 city1) 914)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 668)
	(= (distance city2 city4) 881)
	(= (distance city2 city5) 566)
	(= (distance city2 city6) 508)
	(= (distance city2 city7) 986)
	(= (distance city2 city8) 825)
	(= (distance city3 city0) 826)
	(= (distance city3 city1) 988)
	(= (distance city3 city2) 668)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 612)
	(= (distance city3 city5) 563)
	(= (distance city3 city6) 529)
	(= (distance city3 city7) 933)
	(= (distance city3 city8) 795)
	(= (distance city4 city0) 893)
	(= (distance city4 city1) 792)
	(= (distance city4 city2) 881)
	(= (distance city4 city3) 612)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 779)
	(= (distance city4 city6) 569)
	(= (distance city4 city7) 968)
	(= (distance city4 city8) 904)
	(= (distance city5 city0) 845)
	(= (distance city5 city1) 995)
	(= (distance city5 city2) 566)
	(= (distance city5 city3) 563)
	(= (distance city5 city4) 779)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 729)
	(= (distance city5 city7) 608)
	(= (distance city5 city8) 570)
	(= (distance city6 city0) 665)
	(= (distance city6 city1) 776)
	(= (distance city6 city2) 508)
	(= (distance city6 city3) 529)
	(= (distance city6 city4) 569)
	(= (distance city6 city5) 729)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 555)
	(= (distance city6 city8) 502)
	(= (distance city7 city0) 721)
	(= (distance city7 city1) 915)
	(= (distance city7 city2) 986)
	(= (distance city7 city3) 933)
	(= (distance city7 city4) 968)
	(= (distance city7 city5) 608)
	(= (distance city7 city6) 555)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 915)
	(= (distance city8 city0) 575)
	(= (distance city8 city1) 708)
	(= (distance city8 city2) 825)
	(= (distance city8 city3) 795)
	(= (distance city8 city4) 904)
	(= (distance city8 city5) 570)
	(= (distance city8 city6) 502)
	(= (distance city8 city7) 915)
	(= (distance city8 city8) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city7)
	(at person2 city0)
	(at person3 city7)
	(at person4 city5)
	(at person5 city0)
	(at person6 city5)
	))

(:metric minimize (+ (* 4 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (board person2 plane1 city3)
   deleted: (at person2 city3)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 6
2. (board person6 plane1 city3)
   deleted: (at person6 city3)
   added: (in person6 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 3 of 6
3. (refuel plane1 city3)
   changed: (fuel plane1) from 2119 to 13343
   goals met: 3 of 6
4. (fly plane1 city3 city0)
   deleted: (at plane1 city3)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 0 to 4130, (fuel plane1) from 13343 to 9213
   goals met: 3 of 6
5. (debark person2 plane1 city0)
   deleted: (in person2 plane1)
   added: (at person2 city0)
   changed: (onboard plane1) from 2 to 1
   goals met: 4 of 6
6. (fly plane1 city0 city8)
   deleted: (at plane1 city0)
   added: (at plane1 city8)
   changed: (total-fuel-used) from 4130 to 7005, (fuel plane1) from 9213 to 6338
   goals met: 4 of 6
7. (board person4 plane1 city8)
   deleted: (at person4 city8)
   added: (in person4 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 4 of 6
8. (fly plane1 city8 city5)
   deleted: (at plane1 city8)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 7005 to 9855, (fuel plane1) from 6338 to 3488
   goals met: 4 of 6
9. (debark person4 plane1 city5)
   deleted: (in person4 plane1)
   added: (at person4 city5)
   changed: (onboard plane1) from 2 to 1
   goals met: 5 of 6
10. (debark person6 plane1 city5)
   deleted: (in person6 plane1)
   added: (at person6 city5)
   changed: (onboard plane1) from 1 to 0
   goals met: 6 of 6
